drop database library;
create database if not exists library;
use library;
create table book(
book_name varchar(120) not null,
book_description char(200) default "Description is not exists",
publication_date date not null default "2018-01-01",
author varchar(60) not null,
category varchar(30) not null
);

insert into book (book_name,book_description,author,category)
values
("Фортеця для серця",
"У книзі головною героїнею є любов.А головним героєм,напевно,прощення.",
"Олена Печорна",
"Жіночий роман"
),

("Шпигунка",
"Сюжети своїх книжок Пауло Коельйо бере з життя.",
"Пауло Коельйо",
"Зарубіжна література"),

("Все,що я хотіла сьогодні",
"Цю книжку я написала спеціально для молодих дівчат,щоб вони не робили дурних помилок і завжди залишалися собою",
"Ірен Роздобудько",
"Роман"),

("Одного разу",
"Ця книжка для тих,хто ні в чому не боїться бути відвертим,для кого будь-яка невдача стає відліком нового життя,для тих,хто вірить у диво і в те,що низьких стартів не буває",
"Ірен Роздобудько",
"Роман");

insert into book(book_name,publication_date,author,category)
values
("Ловець у житі",
"1951-07-16",
"Джером Девід Селінджер",
"Роман"),

("Нова стара баба",
"2013-01-01",
"Лариса Денисенко",
"Роман"),

("Тому,що ти є",
"2012-03-02",
"Дара Корній",
"Роман");

insert into book(book_name,author,category)
values
("Джен Ейр",
"Шарлота Бронте",
"Зарубіжна література"),

("До зустрічі з тобою",
"Джоджо Мойєс",
"Роман"),

("Щоденник Мавки",
"Дара Корній",
"Сучасна українська література");


select * from book;








